In [34]:
import pandas as pd
s=pd.Series(['a','b','c','d','e'],index=[1,2,3,4,5])
print(s)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [36]:
import pandas as pd
s=pd.Series(['a','b','c','d','e'])
#by default series take its own index
df=pd.DataFrame(s,index=[1,3,4,5])
df

     0
1    b
3    d
4    e
5  NaN

In [16]:
import pandas as pd
s=pd.Series([['ritersh','bittu','ritesh'],['23','66','66']])
s

0    [ritersh, bittu, ritesh]
1                [23, 66, 66]
dtype: object

In [23]:
import pandas as pd
data=[['ritesh','29'],['sunil','23'],['pawan','19']]
df=pd.DataFrame(data,columns=['name','age'])
df

     name age
0  ritesh  29
1   sunil  23
2   pawan  19

In [28]:
import pandas as pd
#data=[['ritesh','29'],['sunil','23'],['pawan','19']]
df=pd.DataFrame([['ritesh','29'],['sunil','23'],['pawan','19']])
df

        0   1
0  ritesh  29
1   sunil  23
2   pawan  19

In [4]:
import pandas as pd
a=pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
import pandas as pd
s=pd.Series(['a','b','c','d','e'], index=[10,11,12,13,14])
print(s)

10    a
11    b
12    c
13    d
14    e
dtype: object

In [3]:
import pandas as pd
import numpy as np
data=np.array(['a','b','c','d','e'])
s=pd.Series(data, index=[10,11,12,13,14])
print(s)

10    a
11    b
12    c
13    d
14    e
dtype: object

In [3]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
print( pd.DataFrame(data,columns=['Name','Age']))


import pandas as pd
data = [['x1',20,'y1'],['x2',22,'y2'],['x3',33,'y3'], ['x4',23,'y4']]
df = pd.DataFrame(data,columns=['Name','Age','Address'],index=[50,60,70,80])
df

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

   Name  Age Address
50   x1   20      y1
60   x2   22      y2
70   x3   33      y3
80   x4   23      y4

In [4]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [5]:
import pandas as pd
d = {'one' : pd.Series([11, 12, 13]), 'two' : pd.Series([21, 22, 23, 24])}
df = pd.DataFrame(d)
df

    one  two
0  11.0   21
1  12.0   22
2  13.0   23
3   NaN   24

In [6]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1, 2, 3, 4], index=['d', 'e', 'f', 'g'])}
df = pd.DataFrame(d)
df

   one  two
a  1.0  NaN
b  2.0  NaN
c  3.0  NaN
d  NaN  1.0
e  NaN  2.0
f  NaN  3.0
g  NaN  4.0

In [33]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3]), 'two' : pd.Series([1, 2, 3, 4])}
df = pd.DataFrame(d,index=[1,2,3,4])
df

   one  two
1  2.0  2.0
2  3.0  3.0
3  NaN  4.0
4  NaN  NaN

In [2]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1, 2, 3, 4], index=['d', 'e', 'f', 'g'])}
df = pd.DataFrame(d)

print(df['one'])
df['two']

a    1.0
b    2.0
c    3.0
d    NaN
e    NaN
f    NaN
g    NaN
Name: one, dtype: float64

a    NaN
b    NaN
c    NaN
d    1.0
e    2.0
f    3.0
g    4.0
Name: two, dtype: float64

In [7]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)

print("*************************************************************************")
# Adding a new column to an existing DataFrame object with column label by passing new series
print ("Adding a new column by passing as Series:")
df['three']=pd.Series([10,20,30],index=['a','b','c'])
print (df)

print("*************************************************************************")
print ("Adding a new column using the existing columns in DataFrame:")
df['four']=df['one']+df['three']
print (df)

print("*************************************************************************")
print ("Adding a new column using the existing columns in DataFrame:")
df['five']=df['one']*df['three']
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
*************************************************************************
Adding a new column by passing as Series:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
*************************************************************************
Adding a new column using the existing columns in DataFrame:
   one  two  three  four
a  1.0    1   10.0  11.0
b  2.0    2   20.0  22.0
c  3.0    3   30.0  33.0
d  NaN    4    NaN   NaN
*************************************************************************
Adding a new column using the existing columns in DataFrame:

   one  two  three  four  five
a  1.0    1   10.0  11.0  10.0
b  2.0    2   20.0  22.0  40.0
c  3.0    3   30.0  33.0  90.0
d  NaN    4    NaN   NaN   NaN

In [10]:

import pandas as pd
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 'three' : pd.Series([10,20,30], index=['a','b','c'])}
df = pd.DataFrame(d)
print ("Our dataframe is:")
print (df)
# using del function
print ("Deleting the first column using DEL function:")
del df['one']
print (df)
# using pop function
print ("Deleting another column using POP function:")
df.pop('two')
print (df)

Our dataframe is:
   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN
Deleting the first column using DEL function:
   two  three
a    1   10.0
b    2   20.0
c    3   30.0
d    4    NaN
Deleting another column using POP function:
   three
a   10.0
b   20.0
c   30.0
d    NaN

In [2]:
import pandas as pd
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
df
print( df.loc['b'])
print( df.loc['a'])
print( df.loc['d'])
print( df.loc['c'])
print( df.iloc[2])
print( df.iloc[3])
print( df.iloc[0])
print( df.iloc[1])

one    2.0
two    2.0
Name: b, dtype: float64
one    1.0
two    1.0
Name: a, dtype: float64
one    NaN
two    4.0
Name: d, dtype: float64
one    3.0
two    3.0
Name: c, dtype: float64
one    3.0
two    3.0
Name: c, dtype: float64
one    NaN
two    4.0
Name: d, dtype: float64
one    1.0
two    1.0
Name: a, dtype: float64
one    2.0
two    2.0
Name: b, dtype: float64

In [5]:
import pandas as pd
d = {'one' : pd.Series([11, 12, 13,14], index=['a', 'b', 'c','d']), 'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)
print('-------------------')
print(df[2:4])
print('-------------------')
print(df[1:3])
print('-------------------')
print(df[0:3])
print('-------------------')
df[2:10]

   one  two
a   11    1
b   12    2
c   13    3
d   14    4
-------------------
   one  two
c   13    3
d   14    4
-------------------
   one  two
b   12    2
c   13    3
-------------------
   one  two
a   11    1
b   12    2
c   13    3
-------------------

   one  two
c   13    3
d   14    4

In [15]:
import pandas as pd
d = {'one' : pd.Series([11, 12, 13,14], index=['a', 'b', 'c','d']), 'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(d)
print(df)
import pandas as pd
d = {'one' : pd.Series([31, 32, 33,44], index=['e', 'f', 'g','h']), 'two' : pd.Series([51, 52, 53, 54], index=['e', 'f', 'g','h'])}
df2 = pd.DataFrame(d)
print(df2)
df3=df.append(df2)
print(df3)

   one  two
a   11    1
b   12    2
c   13    3
d   14    4
   one  two
e   31   51
f   32   52
g   33   53
h   44   54
   one  two
a   11    1
b   12    2
c   13    3
d   14    4
e   31   51
f   32   52
g   33   53
h   44   54

In [2]:
import pandas as pd
data={'name':pd.Series(['ritesh','bittu','dinesh','sunil','pawan'],index=[1,2,3,4,5]),'age':pd.Series([20,33,12],index=['a','b','c'])}
df=pd.DataFrame(data)
df

     name   age
1  ritesh   NaN
2   bittu   NaN
3  dinesh   NaN
4   sunil   NaN
5   pawan   NaN
a     NaN  20.0
b     NaN  33.0
c     NaN  12.0

In [19]:
import pandas as pd
df=pd.DataFrame(['rityehs','sunil'],index=[1,2])
df

         0
1  rityehs
2    sunil

In [21]:
import pandas as pd
data=['rityehs','sunil']
df=pd.DataFrame(data)
df

         0
0  rityehs
1    sunil

In [22]:
data=['rityehs','sunil']
data

['rityehs', 'sunil']

In [4]:
import pandas as pd
d = {'name' : pd.Series(["ritesh","suneety","pawan","bittu","nic"], index=[0,1,2,3,4]),
     'epsode' : pd.Series([11, 22, 33, 44,55], index=[0,1,2,3,4]),
    'gender':pd.Series(['male','femal','male','male','female'])}
df = pd.DataFrame(d)
df_gender

      name  epsode  gender
0   ritesh      11    male
1  suneety      22   femal
2    pawan      33    male
3    bittu      44    male
4      nic      55  female

In [2]:
import pandas as pd
d = {'name' : pd.Series(["ritesh","suneety","pawan","bittu","nic"], index=[0,1,2,3,4]),
     'epsode' : pd.Series([11, 22, 33, 44,55], index=[0,1,2,3,4]),
    'gender':pd.Series(['male','femal','male','male','female'])}
df = pd.DataFrame(d)
df_gender=pd.get_dummies(df['gender'])
df_new=pd.concat([df,df_gender],axis=1)
print(df_new)

      name  epsode  gender  femal  female  male
0   ritesh      11    male      0       0     1
1  suneety      22   femal      1       0     0
2    pawan      33    male      0       0     1
3    bittu      44    male      0       0     1
4      nic      55  female      0       1     0